Documents/ЗаморозкаАбонемента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>ЗаморозкаАбонемента</Name>
    <Posting>Allow</Posting>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>Клиент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Абонемент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаНачала</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаОкончания</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Причина</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

Enums/СтатусыАбонементаКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>СтатусыАбонементаКлиента</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>Активен</Name>
    </Value>
    <Value>
      <Name>Заморожен</Name>
    </Value>
    <Value>
      <Name>Закончился</Name>
    </Value>
    <Value>
      <Name>Истёк</Name>
    </Value>
    <Value>
      <Name>Отменён</Name>
    </Value>
  </Properties>
</MetaDataObject>

Documents/ЗаморозкаАбонемента/Ext/ObjectModule.bsl
// Модуль документа Заморозка абонемента

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	АбКлиента = Абонемент.ПолучитьОбъект();
	ВидАбонемента = АбКлиента.ВидАбонемента;

	// Ограничения
	Если АбКлиента.Статус = Перечисления.СтатусыАбонементаКлиента.Истёк Тогда
		ВызватьИсключение "Невозможно заморозить истёкший абонемент.";
	КонецЕсли;

	КоличествоДней = (ДатаОкончания - ДатаНачала) / 86400;
	Если Не ВидАбонемента.ВозможностьЗаморозки Тогда
		ВызватьИсключение "Данный абонемент не допускает заморозку.";
	КонецЕсли;
	Если КоличествоДней > ВидАбонемента.МаксимальныйСрокЗаморозки Тогда
		ВызватьИсключение "Превышен допустимый срок заморозки.";
	КонецЕсли;

	АбКлиента.Статус = Перечисления.СтатусыАбонементаКлиента.Заморожен;
	АбКлиента.Заморожено = АбКлиента.Заморожено + КоличествоДней;
	АбКлиента.ДатаОкончания = АбКлиента.ДатаОкончания + КоличествоДней;
	АбКлиента.Записать();

	АудитДействий.ЗарегистрироватьИзменение(ЭтотОбъект, "Заморозка абонемента", "", Строка(Абонемент));
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ПустоеЗначение(Абонемент) Тогда
		Сообщить("Не указан абонемент");
		Отказ = Истина;
	КонецЕсли;
	Если ДатаОкончания <= ДатаНачала Тогда
		Сообщить("Дата окончания должна быть позже даты начала");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
